OpenFOAM-v2412/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (-1.1 -1.1 -0.1)
    ( 1.1 -1.1 -0.1)
    ( 1.1  1.1 -0.1)
    (-1.1  1.1 -0.1)

    (-1.1 -1.1  2.1)
    ( 1.1 -1.1  2.1)
    ( 1.1  1.1  2.1)
    (-1.1  1.1  2.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (21 21 21) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);


// ************************************************************************* //
